Darklight007/ESP32PS3/src/DispObject.cpp
#include "DispObject.h"
#include "device.hpp"   // PowerSupply.mA_Active for measured-bar range scaling
#include <esp32-hal.h>  // xPortGetCoreID

extern volatile bool lvglIsBusy, blockAll;
extern Device PowerSupply;

// =====================================================================
// REVERT SWITCH for SetUpdate() LVGL writes from Core 0:
//   1 → Skip LVGL writes inside SetUpdate when running on Core 0. The
//        function generator (waveform_generator.cpp:212) calls SetUpdate
//        from Task_ADC at 200-500 Hz; direct LVGL writes from Core 0
//        race with Core 1 rendering and corrupt the LVGL object tree,
//        which eventually wedges Core 1 in draw_scrollbar / refr_obj.
//        Flush() runs on Core 1 and picks up adjValueChanged to update
//        the label and bar at its own pace.
//   0 → Original behavior: SetUpdate always writes LVGL (unsafe from
//        Core 0).
// =====================================================================
#ifndef DEFER_DISPOBJ_LVGL_TO_CORE1
#define DEFER_DISPOBJ_LVGL_TO_CORE1 1
#endif
void DispObjects::SetEncoderPins(int aPintNumber, int bPinNumber, enc_isr_cb_t enc_isr_cb = nullptr)
{
    // NOTE: encoder is a member variable (not a pointer), so no memory leak
    // It's constructed once with the DispObjects instance
    encoder.always_interrupt = true;
    encoder._enc_isr_cb = enc_isr_cb;
    encoder.attachHalfQuad(aPintNumber, bPinNumber); // attachFullQuad attachHalfQuad attachSingleEdge
    encoder.clearCount();
    encoder.setCount(0);
    encoder.setFilter(500);
    // ESP32Encoder::useInternalWeakPullResistors = UP;
};

DispObjects::DispObjects() {};
DispObjects::~DispObjects() {};

void DispObjects::measureUpdate(double value)
{
    measured(value);
    rawBarValue = value;  // CRITICAL: Bar uses raw value
    Bar.changed = true;

    // Fast path: skip statistics if power (calculated from V×I, not measured directly)
    bool isPower = (label_unit && lv_label_get_text(label_unit)[0] == 'W');
    if (!isPower) {
        StatisticsUpdate(value);
    }

    // Update display ready flag for all measurements (V, I, and P) every N samples
    if (++sampleCountSinceDisplay >= (measured.NofAvgs)) {
        displayReady = true;
        sampleCountSinceDisplay = 0;
    }

    // Always set changed flag for all measurements (including Power)
    if (oldValue != value) {
        oldValue = value;
        changed = true;
    }
}

void DispObjects::StatisticsUpdate(double value)
{
    Statistics(value);

    // EXPERIMENTAL: ER() returns a 0.0 sentinel (not NaN/inf) whenever the
    // window doesn't have enough samples yet for a real variance (e.g. right
    // after ResetStats()). Pushing that placeholder into effectiveResolution
    // as if it were a real "0-bit" reading briefly drags the moving average
    // down for no physical reason. Skip it until Statistics has >= 2 samples.
    if (Statistics.windowSizeIndex_ >= 2)
    {
        double er_sample = Statistics.ER(2 * adc_maxValue); // maxValue
        // ER() returns a 0.0 sentinel whenever stdDev isn't positive - not a
        // real "0 bits" reading. Averaging those zeros into effectiveResolution
        // dragged the displayed ER far below the true value (seen live: ~6 bits
        // on a signal with no visible noise, where the genuine samples were
        // ~18). A perfectly stable window means "can't measure it this window",
        // so skip it and keep the last good average instead of poisoning it.
        if (std::isfinite(er_sample) && er_sample > 0.0)
            effectiveResolution(er_sample);
    }
}

void DispObjects::displayUpdate(void)
{
    // Only update display after NofAvgs samples collected
    if (!displayReady)
        return;

    displayReady = false;

    double mean_ = measured.Mean();
    if (oldValue != mean_ && !blockAll)
    {
        // Power's range (up into the hundreds of Watts) can exceed what V/I's
        // shared decimal-count setting assumes (tuned for 0-32V / 0-5A) - at
        // the finest (4-decimal) setting, >=100W would print a 9-character
        // "+100.0000", overflowing the box the setting already sized for 8.
        // Drop to 3 decimals ("+100.000", still 8 chars) once Power crosses
        // 100 at that setting; other decimal settings are already short
        // enough not to need this. isPowerObj is cached once in setup() and
        // the format check is a pointer compare (both come from device.cpp's
        // same `formats[]`/kFmt4Decimals) - no strcmp on the hot path.
        const char *fmt = restrict;
        if (isPowerObj && restrict == kFmt4Decimals && fabs(mean_) >= 100.0)
            fmt = "%+08.3f";

        // Display mean of measured data
        lv_label_set_text_fmt(label_measureValue, fmt, mean_);
        oldValue = mean_;
    }
}

void DispObjects::displayUpdate(bool update)
{
    double mean_ = measured.Mean();
    // Display mean  of measured data not the value
    lv_label_set_text_fmt(label_measureValue, restrict, mean_);
}

void DispObjects::statUpdate(void)
{

    lv_label_set_text_fmt(statLabels.label_setSmallFont, "%+08.4f", (adjValue - adjOffset) / adjFactor);
    lv_label_set_text_fmt(statLabels.label_value, "%+08.4f", Statistics.value);
    lv_label_set_text_fmt(statLabels.label_mean, "%+08.4f", Statistics.Mean());
    lv_label_set_text_fmt(statLabels.label_std, "%07.4f", Statistics.StandardDeviation());
    lv_label_set_text_fmt(statLabels.label_max, "%+08.4f", Statistics.absMax);
    lv_label_set_text_fmt(statLabels.label_min, "%+08.4f", Statistics.absMin);
}


void DispObjects::barUpdate(void)
{
    // Guard: skip if Core 1 is rendering — lv_obj_set_x() is not safe from Core 0
    // (camera test 2026-07-23 confirmed: removing this produced stale-pixel
    // corruption within seconds and zero speed gain)
    if (blockAll || lvglIsBusy) return;
    if (!Bar.bar || !Bar.curValuePtr) return;  // Add null check for Power measurement

    // Pre-compute scale factors (per-instance cache in DispObject.h)
    lv_coord_t barMax = lv_bar_get_max_value(Bar.bar);
    if (barMax != cachedBarMax || cachedScaleFactor == 0) {
        cachedBarMax = barMax;
        cachedBarWidth = lv_obj_get_width(Bar.bar);
        cachedBarX = lv_obj_get_x(Bar.bar);
        cachedScaleFactor = adjFactor / maxValue;
    }

    // MEASURED bar only (shadow/setpoint bar is handled by shadowBarWidth()).
    // In mA mode the measured value is mA-numeric (0..8.192) but
    // cachedScaleFactor assumes the A range's full scale of 6.5536 A. The mA
    // range's full scale is 8.192 mA = 6.5536 x 1.25, so divide the scale by
    // 1.25 for the Current instance when mA is active. mA_Active is a bool
    // (atomic read on Xtensa), computed fresh each call - no cached value to
    // go stale on a range toggle, which is what sank an earlier attempt here.
    double scale = cachedScaleFactor;
    if (this == &PowerSupply.Current && PowerSupply.mA_Active)
        scale /= 1.25; // full bar at 8.192 mA instead of 6.5536 A

    // Compute bar value before critical section
    int32_t newBarValue = rawBarValue * scale * cachedBarMax;

    // OPTIMIZED: Direct pointer write instead of lv_bar_set_value()
    if (*Bar.curValuePtr != newBarValue) {
        *Bar.curValuePtr = newBarValue;
        lv_obj_invalidate(Bar.bar);
    }

