Darklight007/ESP32PS3/src/DispObject.cpp
    // Update max/min markers only on change — unconditional lv_obj_set_x() did a
    // style lookup every 1ms tick (~2000/s) even when the markers hadn't moved
    // (AUDIT_BARGRAPH_ENCODER #3), stealing Core 0 time from the ADC path.
    // Finite guard BEFORE the int() casts: absMin/absMax are +/-inf right
    // after ResetStats(), and casting inf to int is UB (documented hang risk
    // in input_handler.cpp's 'T' handler) - skip markers until samples exist.
    if (std::isfinite(measured.absMax)) {
        int newMaxX = cachedBarX + int(measured.absMax * scale * cachedBarWidth) - 3;
        if (newMaxX != lastMaxMarkerX) { lv_obj_set_x(Bar.bar_maxMarker, newMaxX); lastMaxMarkerX = newMaxX; }
    }
    if (std::isfinite(measured.absMin)) {
        int newMinX = cachedBarX + int(measured.absMin * scale * cachedBarWidth) - 3;
        if (newMinX != lastMinMarkerX) { lv_obj_set_x(Bar.bar_minMarker, newMinX); lastMinMarkerX = newMinX; }
    }

    Bar.changed = false;
}


// void DispObjects::barUpdate(void)
// {
//     // ULTRA-FAST PATH: Maximum speed bar update with direct memory manipulation
//     // Every nanosecond counts in the Core 0 ADC critical path!

//     // Fast null check - branch prediction friendly (usually true)
//     if (__builtin_expect((!Bar.bar || !Bar.curValuePtr), 0)) return;

//     // Pre-compute scale factors (cached - only on first call)
//     static lv_coord_t cachedBarMax = 0;
//     static lv_coord_t cachedBarX = 0;
//     static float cachedBarScaleFactor = 0.0f;      // float is faster than double on ESP32
//     static float cachedMarkerScaleFactor = 0.0f;   // Pre-multiplied for markers

//     // Initialization path (taken once)
//     if (__builtin_expect((cachedBarMax == 0), 0)) {
//         cachedBarMax = lv_bar_get_max_value(Bar.bar);
//         lv_coord_t cachedBarWidth = lv_obj_get_width(Bar.bar);
//         cachedBarX = lv_obj_get_x(Bar.bar);
//         cachedBarScaleFactor = (adjFactor / maxValue) * cachedBarMax;     // Pre-multiply
//         cachedMarkerScaleFactor = (adjFactor / maxValue) * cachedBarWidth; // Pre-multiply
//     }

//     // DIRECT MEMORY WRITE: Bar value (no function calls, no validation)
//     int32_t newBarValue = static_cast<int32_t>(rawBarValue * cachedBarScaleFactor);

//     if (*Bar.curValuePtr != newBarValue) {
//         *Bar.curValuePtr = newBarValue;  // Direct write to lv_bar_t.cur_value
//         lv_obj_invalidate(Bar.bar);      // Mark for redraw (TODO: can we bypass this too?)
//     }

//     // DIRECT MEMORY WRITE: Marker positions (bypass lv_obj_set_x completely)
//     // Writing directly to coords.x1 - MAXIMUM SPEED!
//     if (__builtin_expect((Bar.maxMarkerXPtr && Bar.minMarkerXPtr), 1)) {
//         *Bar.maxMarkerXPtr = cachedBarX + static_cast<lv_coord_t>(measured.absMax * cachedMarkerScaleFactor) - 3;
//         *Bar.minMarkerXPtr = cachedBarX + static_cast<lv_coord_t>(measured.absMin * cachedMarkerScaleFactor) - 3;

//         // Mark markers as dirty (faster than full lv_obj_set_x which does layout recalc)
//         lv_obj_invalidate(Bar.bar_maxMarker);
//         lv_obj_invalidate(Bar.bar_minMarker);
//     }

//     Bar.changed = false;
// }

void DispObjects::enableSetting(bool onOff)
{
    if (onOff)
        lv_obj_clear_flag(label_set, LV_OBJ_FLAG_HIDDEN);
    else
        lv_obj_add_flag(label_set, LV_OBJ_FLAG_HIDDEN);
}
char *DispObjects::getValue()
{
    return lv_label_get_text(label_measureValue);
}

void DispObjects::SetRotaryStep(double val)
{
    rotaryEncoderStep = val;
}

lv_coord_t DispObjects::shadowBarWidth(void)
{
    // Base fraction: setpoint counts over the full DAC-count span. adjValue,
    // adjOffset and maxValue are all DAC counts, so no adjFactor here.
    double frac = (adjValue - adjOffset) / maxValue;

    // mA range (Current only): the setpoint stays in A-range counts
    // (10 counts/mA - confirmed on hardware: entering "40 mA" = 400 counts;
    // the shunt change did NOT alter this side), but the bar's full scale in
    // mA mode is 8.192 mA = 81.92 counts. So the on-bar fraction is 800x the
    // count fraction (65536/10 / 8.192 = 800 exactly). Same fresh-read
    // pattern as barUpdate(): bool read is atomic, nothing cached to go stale.
    if (this == &PowerSupply.Current && PowerSupply.mA_Active)
        frac *= 800.0;

    // Setpoints above the mA range's 8.192 mA ceiling would overflow the
    // track - clamp to the bar's full width.
    if (frac > 1.0) frac = 1.0;
    if (frac < 0.0) frac = 0.0;

    return (lv_coord_t)(frac * lv_bar_get_max_value(Bar.bar));
}

void DispObjects::SetUpdate(int value, bool bypassLock)
{
    // value-= adjOffset;
    // if (lock || value / adjFactor < minValue || value / adjFactor > maxValue)
    if ((lock && !bypassLock) || (value) < 0 || (value - adjOffset) > maxValue)
    {
        myTone(NOTE_A5, 50);
        return;
    }
    // adjValue = std::max(std::min(value, maxValue), minValue);
    // adjValue = std::max(std::min(value, int(maxValue * adjFactor)), int(minValue * adjFactor));
    // adjValue = std::clamp(value, minValue, maxValue); => already taken care of
    adjValue = value;

    if (adjValue != adjValueOld)
    {
        adjValueChanged = true;
        adjValueOld = adjValue;
        myTone(NOTE_A4, 3);
    }

#if DEFER_DISPOBJ_LVGL_TO_CORE1
    // Function generator on Core 0 (Task_ADC) calls SetUpdate at 200-500 Hz.
    // Skip the LVGL writes here when not on Core 1; Flush() runs on Core 1
    // (via FlushMeasuresInterval) and updates the label/bar from adjValueChanged.
    if (xPortGetCoreID() != 1) return;
#endif

    // LV_LOG_USER("LOG: %s", "Beep!");
    // lv_disp_enable_invalidation( lv_disp_get_default(), false);
    // if (!lvglIsBusy)

    // Null pointer checks to prevent crashes during calibration or when UI not initialized
    if (label_setValue && label_unit) {
        lv_label_set_text_fmt(label_setValue, "%+08.4f%s", (adjValue - adjOffset) / adjFactor, lv_label_get_text(label_unit));
        // Invalidate parent to clean artifacts from overlapping transparent widgets
        lv_obj_t *parent = lv_obj_get_parent(label_setValue);
        if (parent) lv_obj_invalidate(parent);
    }
    if (Bar.bar_adjValue && Bar.bar) {
        lv_obj_set_width(Bar.bar_adjValue, shadowBarWidth());
    }

    // Serial.printf("\nmaxValue %15.5f  ",maxValue);
}

void DispObjects::Flush(void)
{

    if (adjValueChanged)
    {
        // static char *a = (char *)malloc(8);
        // char * a="%+08.4f";
        // strcpy(a, "%+08.4f");
        // strcat(a, lv_label_get_text(label_unit));
        // lv_label_set_text_fmt(label_setValue, a, adjValue +adjOffset);
        if (strcmp(lv_label_get_text(label_unit), "A"))

            lv_label_set_text_fmt(label_setValue, "%+08.4fV", (adjValue - adjOffset) / adjFactor);
        else
            lv_label_set_text_fmt(label_setValue, "%+08.4fA", (adjValue - adjOffset) / adjFactor);

        // Update the setpoint shadow bar - shared formula with SetUpdate()'s
        // direct-write path (see shadowBarWidth()). Keeping ONE implementation
        // matters: these two paths once drifted apart (Flush had an extra
        // /adjFactor) and the shadow bar "vanished" on every encoder turn
        // (Core 0 defers LVGL writes to this Flush) while keypad entry
        // (Core 1, SetUpdate's own write) restored it.
        lv_obj_set_width(Bar.bar_adjValue, shadowBarWidth());
        adjValueChanged = false;
        // lv_obj_invalidate(label_setValue);
        // Serial.printf("\n%10.4f", (adjValue - adjOffset) / adjFactor);
    }
    // _lv_disp_refr_timer(NULL);
}

