Darklight007/ESP32PS3/src/DispObject.cpp
void DispObjects::SetEncoderUpdate(void)
{
    // static int counter = 0;
    // if ((counter++ % 4) == 3)

    static int64_t rotaryOldValue = 0;
    int64_t count = encoder.getCount() >> 1;
    if (rotaryOldValue == count)
        return;

    // Locked: still track the encoder position (so unlocking later doesn't
    // suddenly jump by however far it turned while locked), just don't act on it.
    if (!lock)
    {
        if (count > rotaryOldValue)
            SetUpdate(adjValue + rotaryEncoderStep);

        else if (count < rotaryOldValue)
            SetUpdate(adjValue - rotaryEncoderStep);
    }

    rotaryOldValue = count;
    // adjValueChanged=true;
}

void DispObjects::setLock(bool lck)
{
    if (lck)
    {
        lv_obj_clear_flag(lock_img, LV_OBJ_FLAG_HIDDEN);
        lv_obj_add_flag(unlock_img, LV_OBJ_FLAG_HIDDEN);
    }
    else
    {
        lv_obj_clear_flag(unlock_img, LV_OBJ_FLAG_HIDDEN);
        lv_obj_add_flag(lock_img, LV_OBJ_FLAG_HIDDEN);
    }
    lock = lck;
}
bool DispObjects::getLock()
{
    return lock;
}

void DispObjects::setMeasureColor(lv_color_t color)
{

    lv_style_set_text_color(&style_deviceColor, color);

    lv_obj_remove_style(label_measureValue, &style_deviceColor, LV_STATE_DEFAULT);
    lv_obj_add_style(label_measureValue, &style_deviceColor, LV_STATE_DEFAULT);

    lv_obj_remove_style(label_unit, &style_deviceColor, LV_STATE_DEFAULT);
    lv_obj_add_style(label_unit, &style_deviceColor, LV_STATE_DEFAULT);

    lv_obj_remove_style(label_si_prefix, &style_deviceColor, LV_STATE_DEFAULT);
    lv_obj_add_style(label_si_prefix, &style_deviceColor, LV_STATE_DEFAULT);

    lv_style_set_bg_color(&style_deviceColor, color);
    lv_obj_remove_style(Bar.bar, &style_deviceColor, LV_PART_INDICATOR);
    lv_obj_add_style(Bar.bar, &style_deviceColor, LV_PART_INDICATOR);

    // if (label_unit)
    //     lv_obj_add_style(label_std, &style_deviceColor, LV_PART_INDICATOR);
}

void DispObjects::setStatsColor(lv_color_t color)
{

    // Serial.println(lv_label_get_text(label_unit));

    if (strcmp(lv_label_get_text(label_unit), "V") == 0)
    {
        lv_style_set_text_color(&stat_style1, color);

        lv_obj_remove_style(statLabels.label_value, &stat_style1, LV_STATE_DEFAULT);
        lv_obj_add_style(statLabels.label_value, &stat_style1, LV_STATE_DEFAULT);

        lv_obj_remove_style(statLabels.label_mean, &stat_style1, LV_STATE_DEFAULT);
        lv_obj_add_style(statLabels.label_mean, &stat_style1, LV_STATE_DEFAULT);

        lv_obj_remove_style(statLabels.label_std, &stat_style1, LV_STATE_DEFAULT);
        lv_obj_add_style(statLabels.label_std, &stat_style1, LV_STATE_DEFAULT);

        lv_obj_remove_style(statLabels.label_max, &stat_style1, LV_STATE_DEFAULT);
        lv_obj_add_style(statLabels.label_max, &stat_style1, LV_STATE_DEFAULT);

        lv_obj_remove_style(statLabels.label_min, &stat_style1, LV_STATE_DEFAULT);
        lv_obj_add_style(statLabels.label_min, &stat_style1, LV_STATE_DEFAULT);
    }
    else
    {
        lv_style_set_text_color(&stat_style2, color);

        lv_obj_remove_style(statLabels.label_std, &stat_style2, LV_STATE_DEFAULT);
        lv_obj_add_style(statLabels.label_std, &stat_style2, LV_STATE_DEFAULT);

        lv_obj_remove_style(statLabels.label_value, &stat_style2, LV_STATE_DEFAULT);
        lv_obj_add_style(statLabels.label_value, &stat_style2, LV_STATE_DEFAULT);

        lv_obj_remove_style(statLabels.label_mean, &stat_style2, LV_STATE_DEFAULT);
        lv_obj_add_style(statLabels.label_mean, &stat_style2, LV_STATE_DEFAULT);

        lv_obj_remove_style(statLabels.label_max, &stat_style2, LV_STATE_DEFAULT);
        lv_obj_add_style(statLabels.label_max, &stat_style2, LV_STATE_DEFAULT);

        lv_obj_remove_style(statLabels.label_min, &stat_style2, LV_STATE_DEFAULT);
        lv_obj_add_style(statLabels.label_min, &stat_style2, LV_STATE_DEFAULT);
    }
}

void DispObjects::SetupStyles()
{

    // lv_style_init(&style_set);
}

void DispObjects::setup(lv_obj_t *parent, const char *_text, int x, int y, const char *_unit, double maxValue_, double minValue_, double mTick,
                        double offset_, double factor_, const char *si_prefix,
                        const lv_font_t *font_measure, const lv_font_t *font_unit)
{
    maxValue = maxValue_;
    minValue = minValue_;
    isPowerObj = (strcmp(_unit, "W") == 0);

    // SetRotaryStep(maxValue_ / 65535);
    SetRotaryStep(1);
    measured.SetWindowSize(4);
    adjOffset = offset_; // / 1000.0; // Convert from milli volts/current to volt and current
    adjFactor = factor_;
    // const lv_font_t *font_measure = &dseg_b_48;
    // const lv_font_t *font_set = &Undertale_16b1; // WindyCity_16b4; // Undertale_16b;
    measureColor = {lv_palette_darken(LV_PALETTE_GREY, 3)};

    // effectiveResolution.SetWindowSize(4);
    /******************************
     **   Init hist
     ******************************/

    hist.histWinMax = maxValue;
    hist.histWinMin = minValue;

    /******************************
     **   Init styles
     ******************************/
    lv_style_init(&style_deviceColor);
    lv_style_init(&stat_style2);
    lv_style_init(&stat_style1);
    lv_style_init(&style_set);
    lv_style_init(&style_highlight_adjValue);
    lv_style_init(&style_set);
    /******************************
     **   Set
     ******************************/
    label_set = lv_label_create(parent);

    lv_label_set_text(label_set, _text);
    lv_obj_remove_style_all(label_set);
    lv_obj_align(label_set, LV_ALIGN_DEFAULT, x + 4, y);
    lv_style_set_text_font(&style_set, font_set);
    lv_style_set_text_letter_space(&style_set, -1);
    lv_obj_add_style(label_set, &style_set, LV_STATE_DEFAULT);
    label_setValue = lv_label_create(label_set);
    lv_label_set_text(label_setValue, "+00.0000");
    lv_obj_align(label_setValue, LV_ALIGN_DEFAULT, x + 85, 0);

    /******************************
     **   Highlight
     ******************************/
    highlight_adjValue = lv_obj_create(parent);
    lv_obj_remove_style_all(highlight_adjValue);
    lv_obj_set_size(highlight_adjValue, 12, 17);
    lv_obj_align(highlight_adjValue, 0, 8 * 12 - 2 - kHighlightXShift, -1);

    // static lv_style_t style_highlight_adjValue;
    // lv_style_init(&style_highlight_adjValue);
    lv_style_set_radius(&style_highlight_adjValue, 0);
    lv_style_set_border_width(&style_highlight_adjValue, 0);
    lv_style_set_bg_opa(&style_highlight_adjValue, LV_OPA_100);
    lv_obj_add_flag(highlight_adjValue, LV_OBJ_FLAG_FLOATING);
    lv_style_set_bg_color(&style_highlight_adjValue, lv_palette_main(LV_PALETTE_DEEP_ORANGE));
    lv_obj_remove_style(highlight_adjValue, &style_highlight_adjValue, LV_STATE_DEFAULT);
    lv_obj_add_style(highlight_adjValue, &style_highlight_adjValue, LV_STATE_DEFAULT);
    lv_obj_move_background(highlight_adjValue);
    lv_obj_add_flag(highlight_adjValue, LV_OBJ_FLAG_HIDDEN);

    /******************************
     **   Lock/Unlock
     ******************************/
    lock_img = lv_img_create(parent);
    lv_obj_remove_style_all(lock_img);

