Darklight007/ESP32PS3/src/DispObject.cpp
    lv_img_set_src(lock_img, &p_l);
    lv_obj_align(lock_img, LV_ALIGN_DEFAULT, x + 186, y - 2);
    lv_obj_set_style_img_recolor_opa(lock_img, LV_OPA_100, 0);
    lv_obj_set_style_img_recolor(lock_img, lv_color_white(), 0);

    unlock_img = lv_img_create(parent);
    lv_obj_remove_style_all(unlock_img);
    lv_img_set_src(unlock_img, &p_u);
    lv_obj_align(unlock_img, LV_ALIGN_DEFAULT, x + 186, y - 2);
    lv_obj_set_style_img_recolor_opa(unlock_img, LV_OPA_100, 0);
    lv_obj_set_style_img_recolor(unlock_img, lv_color_white(), 0);

    lv_obj_add_flag(lock_img, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(unlock_img, LV_OBJ_FLAG_HIDDEN);
    // lv_obj_clear_flag(img2, LV_OBJ_FLAG_HIDDEN);

    /******************************
     **   Stats
     ******************************/

    // label_setSmallFont = lv_label_create(label_set);
    // label_value = lv_label_create(label_set);
    // label_mean = lv_label_create(label_set);
    // label_std = lv_label_create(label_set);
    // label_max = lv_label_create(label_set);
    // label_min = lv_label_create(label_set);

    statLabels.label_unit = lv_label_create(label_set);
    lv_obj_align(statLabels.label_unit, LV_ALIGN_DEFAULT, -500, -500);
    statLabels.label_setSmallFont = lv_label_create(label_set);
    lv_obj_align(statLabels.label_setSmallFont, LV_ALIGN_DEFAULT, -500, -500);
    statLabels.label_value = lv_label_create(label_set);
    lv_obj_align(statLabels.label_value, LV_ALIGN_DEFAULT, -500, -500);
    statLabels.label_mean = lv_label_create(label_set);
    lv_obj_align(statLabels.label_mean, LV_ALIGN_DEFAULT, -500, -500);
    statLabels.label_max = lv_label_create(label_set);
    lv_obj_align(statLabels.label_max, LV_ALIGN_DEFAULT, -500, -500);
    statLabels.label_min = lv_label_create(label_set);
    lv_obj_align(statLabels.label_min, LV_ALIGN_DEFAULT, -500, -500);
    statLabels.label_std = lv_label_create(label_set);
    lv_obj_align(statLabels.label_std, LV_ALIGN_DEFAULT, -500, -500);
    statLabels.label_fft = lv_label_create(label_set);
    lv_obj_align(statLabels.label_fft, LV_ALIGN_DEFAULT, 0, -500);
    statLabels.label_legend = lv_label_create(label_set);
    lv_obj_align(statLabels.label_legend, LV_ALIGN_DEFAULT, 0, -500);

    /******************************
     **   Measure
     ******************************/
    label_measureValue = lv_label_create(parent); // parent
    lv_obj_remove_style_all(label_measureValue);
    lv_label_set_text(label_measureValue, "+00.000");
    lv_obj_align(label_measureValue, LV_ALIGN_DEFAULT, -14 - 10, y + 17);

    lv_style_init(&style_measure);
    lv_style_set_text_letter_space(&style_measure, 0);
    lv_style_set_text_color(&style_measure, measureColor);
    lv_style_set_text_font(&style_measure, font_measure);
    lv_obj_remove_style(label_measureValue, &style_measure, LV_STATE_DEFAULT);
    lv_obj_add_style(label_measureValue, &style_measure, LV_STATE_DEFAULT);

    /******************************
     **   Unit
     ******************************/
    label_unit = lv_label_create(parent);
    lv_obj_remove_style_all(label_unit);
    lv_label_set_text(label_unit, _unit);
    lv_obj_align(label_unit, LV_ALIGN_DEFAULT, x + 269, y + 3);

    // lv_style_init(&style_unit);
    lv_style_set_text_font(&style_unit, font_unit);
    lv_style_set_text_color(&style_unit, measureColor);
    lv_obj_remove_style(label_unit, &style_unit, LV_STATE_DEFAULT);
    lv_obj_add_style(label_unit, &style_unit, LV_STATE_DEFAULT);

    /******************************
     **   SI_Prefix
     ******************************/
    lv_obj_add_flag(label_unit, LV_OBJ_FLAG_OVERFLOW_VISIBLE);
    label_si_prefix = lv_label_create(label_unit);
    lv_obj_remove_style_all(label_si_prefix);
    lv_label_set_text(label_si_prefix, si_prefix); // µΩm
    // lv_obj_align(label_si_prefix, LV_ALIGN_DEFAULT, x + 269-15, y + 3);
    lv_obj_align(label_si_prefix, LV_ALIGN_DEFAULT, -12, +2);

    lv_style_init(&style_si_prefix);
    lv_style_set_text_letter_space(&style_si_prefix, 0);
    lv_style_set_text_color(&style_si_prefix, measureColor);
    lv_style_set_text_font(&style_si_prefix, &DejaVuSans_b_22); //&DejaVuSans_R_24 &Tauri_R_20
    lv_obj_remove_style(label_si_prefix, &style_si_prefix, LV_STATE_DEFAULT);
    lv_obj_add_style(label_si_prefix, &style_si_prefix, LV_STATE_DEFAULT);

    lv_obj_add_flag(label_si_prefix, LV_OBJ_FLAG_HIDDEN);

    /******************************
     **   Bar
     ******************************/
    auto barLength = 290.0;

    /******************************
    **   Bar Setting
    ******************************/
    if (strcmp(_unit, "W") != 0)
    {
        Bar.bar_adjValue = lv_obj_create(label_set);
        lv_obj_set_size(Bar.bar_adjValue, barLength, 5);
        lv_obj_align(Bar.bar_adjValue, 0, 5, 70);
        static lv_style_t style_bar_adjValue;
        static bool style_bar_adjValue_inited = false;
        if (!style_bar_adjValue_inited) {
            style_bar_adjValue_inited = true;
            lv_style_init(&style_bar_adjValue);
            lv_style_set_border_width(&style_bar_adjValue, 0);
            // Darker + lower opacity than the original 0xB1BFB1 @ 40% - the
            // shadow should read as a faint reference mark, not compete with
            // the measured bar.
            lv_style_set_bg_opa(&style_bar_adjValue, LV_OPA_30);
            lv_style_set_bg_color(&style_bar_adjValue, lv_color_hex(0x5A625A));
        }
        lv_obj_remove_style(Bar.bar_adjValue, &style_bar_adjValue, LV_STATE_DEFAULT);
        lv_obj_add_style(Bar.bar_adjValue, &style_bar_adjValue, LV_STATE_DEFAULT);
    }

    /******************************
     **   Bar.bar
     ******************************/

    Bar.bar = lv_bar_create(label_set);

    /******************************
     ** no need bars and ticks for power (save momory)
     ******************************/
    if (strcmp(_unit, "W") == 0)
        return;

    LV_IMG_DECLARE(img_skew_strip328);
    lv_bar_set_range(Bar.bar, 0, barLength);
    static lv_style_t style_indic;
    static bool style_indic_inited = false;
    if (!style_indic_inited) {
        style_indic_inited = true;
        lv_style_init(&style_indic);
        lv_style_set_bg_img_src(&style_indic, &img_skew_strip328);
        lv_style_set_bg_img_tiled(&style_indic, 40);
        lv_style_set_bg_img_opa(&style_indic, LV_OPA_50);
        lv_style_set_radius(&style_indic, 0);
    }
    lv_obj_remove_style(Bar.bar, NULL, LV_PART_MAIN);
    lv_obj_remove_style(Bar.bar, &style_indic, LV_STATE_DEFAULT);
    lv_obj_add_style(Bar.bar, &style_indic, LV_PART_INDICATOR);
    lv_obj_set_size(Bar.bar, barLength, 5);
    lv_obj_align(Bar.bar, 0, 2, 70);
    lv_bar_set_value(Bar.bar, 0, LV_ANIM_OFF);

    /******************************
     **   Bar ticks
     ******************************/
    static lv_point_t majorTick[] = {{0, 0}, {0, 3}};
    static lv_point_t minorTick[] = {{0, 0}, {0, 1}};

    lv_obj_t *lineMj[7];
    lv_obj_t *lineMn[32];

    double tickDist = barLength / floor(maxValue / adjFactor * 5.0 / mTick);

    for (auto i = 0; i < 7; i++)
    {
        lineMj[i] = lv_line_create(label_set);
        lv_line_set_points(lineMj[i], majorTick, 2); /*Set the points*/
        lv_obj_align(lineMj[i], 0, 2 + i * tickDist * 5, 70 + 1);
    }

    for (auto i = 0; i < 32; i++)
    {
        lineMn[i] = lv_line_create(label_set);
        lv_line_set_points(lineMn[i], minorTick, 2); /*Set the points*/
        lv_obj_align(lineMn[i], 0, 2 + i * tickDist, 70 + 4);
    }

    /******************************
    **   Bar max Value
    ******************************/
    Bar.bar_maxValue = lv_label_create(label_set);
    static char buffer[64];

