Darklight007/ESP32PS3/src/DispObject.cpp
    lv_label_set_text(Bar.bar_maxValue, buffer);
    static lv_style_t style_barMaxValue;
    static bool style_barMaxValue_inited = false;
    if (!style_barMaxValue_inited) {
        style_barMaxValue_inited = true;
        lv_style_init(&style_barMaxValue);
        lv_style_set_text_letter_space(&style_barMaxValue, 0);
        lv_style_set_text_color(&style_barMaxValue, lv_palette_lighten(LV_PALETTE_AMBER, 5));
        lv_style_set_text_font(&style_barMaxValue, &ATARISTOCRAT_16bt);
    }
    lv_obj_remove_style(Bar.bar_maxValue, &style_barMaxValue, LV_STATE_DEFAULT);
    lv_obj_add_style(Bar.bar_maxValue, &style_barMaxValue, LV_STATE_DEFAULT);
    lv_obj_align(Bar.bar_maxValue, LV_ALIGN_DEFAULT, x + barLength + 26, 70 - 2);
    // voltageScaleFactor
    Bar.scaleFactor = lv_bar_get_max_value(Bar.bar) / (maxValue / adjFactor) * .5;
    Bar.curValuePtr = &((lv_bar_t *)Bar.bar)->cur_value;

    //  int32_t *curValuePtr = &((lv_bar_t *)PowerSupply.Voltage.Bar.bar)->cur_value;

    /******************************
     **   Bar min Marker
     ******************************/
    Bar.bar_minMarker = lv_label_create(label_set);
    lv_label_set_text(Bar.bar_minMarker, "^");
    static lv_style_t style_barLabelMinMarker;
    static bool style_barMinMarker_inited = false;
    if (!style_barMinMarker_inited) {
        style_barMinMarker_inited = true;
        lv_style_init(&style_barLabelMinMarker);
        lv_style_set_text_font(&style_barLabelMinMarker, &lv_font_unscii_8);
        lv_style_set_text_color(&style_barLabelMinMarker, lv_palette_lighten(LV_PALETTE_AMBER, 1));
    }
    lv_obj_remove_style(Bar.bar_minMarker, &style_barLabelMinMarker, LV_STATE_DEFAULT);
    lv_obj_add_style(Bar.bar_minMarker, &style_barLabelMinMarker, LV_STATE_DEFAULT);

    lv_obj_align(Bar.bar_minMarker, 0, -1, 70 + 4);

    /******************************
     **   Bar max Marker
     ******************************/
    Bar.bar_maxMarker = lv_label_create(label_set);
    lv_label_set_text(Bar.bar_maxMarker, "^");
    static lv_style_t style_barLabelMaxMarker;
    static bool style_barMaxMarker_inited = false;
    if (!style_barMaxMarker_inited) {
        style_barMaxMarker_inited = true;
        lv_style_init(&style_barLabelMaxMarker);
        lv_style_set_text_font(&style_barLabelMaxMarker, &lv_font_unscii_8);
        lv_style_set_text_color(&style_barLabelMaxMarker, lv_palette_lighten(LV_PALETTE_RED, 1));
    }
    lv_obj_remove_style(Bar.bar_maxMarker, &style_barLabelMaxMarker, LV_STATE_DEFAULT);
    lv_obj_add_style(Bar.bar_maxMarker, &style_barLabelMaxMarker, LV_STATE_DEFAULT);

    lv_obj_align(Bar.bar_maxMarker, 0, -1, 70 + 4);

    // SPEED OPTIMIZATION: Direct pointers to marker X coordinates
    // Bypasses lv_obj_set_x() function call overhead for maximum performance
    Bar.minMarkerXPtr = &(Bar.bar_minMarker->coords.x1);
    Bar.maxMarkerXPtr = &(Bar.bar_maxMarker->coords.x1);
}
